# Missing values

In [15]:
import numpy as np
import pandas as pd

In [16]:
np.nan

nan

In [17]:
np.nan + 0

nan

In [18]:
np.nan > 0

False

In [19]:
pd.options.mode.use_inf_as_na = True

In [20]:
pd.NA + 'Hola Mundo'

In [21]:
pd.NA | False

In [22]:
df = pd.DataFrame(np.arange(0, 15).reshape(5, 3), columns=['a', 'b', 'c'])
df

    a   b   c
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [23]:
df['d'] = np.nan
df['e'] = np.arange(15, 20)
df.loc[5,:] = pd.NA
df.loc[4, 'a'] = pd.NA
df.loc[0, 'd'] = 1
df.loc[5, 'd'] = 10
df

      a     b     c    d     e
0   0.0   1.0   2.0    1  15.0
1   3.0   4.0   5.0  NaN  16.0
2   6.0   7.0   8.0  NaN  17.0
3   9.0  10.0  11.0  NaN  18.0
4  <NA>  13.0  14.0  NaN  19.0
5  <NA>  <NA>  <NA>   10  <NA>

In [24]:
df.isnull()

       a      b      c      d      e
0  False  False  False  False  False
1  False  False  False   True  False
2  False  False  False   True  False
3  False  False  False   True  False
4   True  False  False   True  False
5   True   True   True  False   True

In [25]:
df.isnull().sum()

a    2
b    1
c    1
d    4
e    1
dtype: int64

In [28]:
df.isnull().sum(axis=1)

0    0
1    1
2    1
3    1
4    2
5    4
dtype: int64

In [30]:
df.isnull().sum().sum()

9

In [32]:
df

      a     b     c    d     e
0   0.0   1.0   2.0    1  15.0
1   3.0   4.0   5.0  NaN  16.0
2   6.0   7.0   8.0  NaN  17.0
3   9.0  10.0  11.0  NaN  18.0
4  <NA>  13.0  14.0  NaN  19.0
5  <NA>  <NA>  <NA>   10  <NA>

In [34]:
df[df['a'].notnull()]

     a     b     c    d     e
0  0.0   1.0   2.0    1  15.0
1  3.0   4.0   5.0  NaN  16.0
2  6.0   7.0   8.0  NaN  17.0
3  9.0  10.0  11.0  NaN  18.0

In [36]:
df.dropna()

     a    b    c  d     e
0  0.0  1.0  2.0  1  15.0

In [37]:
df[['a']].dropna()

     a
0  0.0
1  3.0
2  6.0
3  9.0

In [39]:
df.fillna(0)

     a     b     c   d     e
0  0.0   1.0   2.0   1  15.0
1  3.0   4.0   5.0   0  16.0
2  6.0   7.0   8.0   0  17.0
3  9.0  10.0  11.0   0  18.0
4  0.0  13.0  14.0   0  19.0
5  0.0   0.0   0.0  10   0.0

In [54]:
df['d'] = df['d'].fillna(df.median())

In [55]:
df_d = pd.concat([df[['d']], df[['d']].interpolate()], axis=1)
df_d.columns = ['d_antes', 'd_interpolado']
df_d

   d_antes  d_interpolado
0      1.0            1.0
1      NaN            2.8
2      NaN            4.6
3      NaN            6.4
4      NaN            8.2
5     10.0           10.0